package com.beecampus.common;

/*******************************************************************
 * Constant.java  2018/12/11
 * <P>
 * 常量类<br/>
 * <br/>
 * </p>
 * Copyright2018 by GNNT Company. All Rights Reserved.
 *
 *
 ******************************************************************/
public interface Constant {
    // =============================是否int型================================//

    /**
     * 是
     */
    int TRUE = 1;

    /**
     * 否
     */
    int FALSE = 0;

    // =============================时间常量================================//

    /**
     * 秒的毫秒数
     */
    long SECOND = 1000;

    /**
     * 分的毫秒数
     */
    long MINUTE = 60 * SECOND;

    /**
     * 时的毫秒数
     */
    long HOUR = 60 * MINUTE;

    /**
     * 日的毫秒数
     */
    long DAY = 24 * HOUR;

    // =============================用户模块================================//

    /**
     * 短信重发倒计时
     */
    int MESSAGE_COUNTDOWN = 10;

    /**
     * 头像尺寸
     */
    int CONFIG_HEAD_SIZE = 256;

}
